package by.academy.lesson4;

public class Task1 {

	public static void main(String[] args) {
		// 1. Составьте программу, выводящую на экран квадраты чисел от 10 до 20.
		for (int i = 10; i < 21; i++) {
			int a = i*i;
			System.out.println(a);
		}

	}

}
